#coding:utf-8


# -----------------------------doc--------------------------
# 工单 描述
WORKLIST_DOC = """
功能描述：生成一个基于业务的QoS保障测试-UDP工单

    参数：
    | DIP_Min        | 222.66.65.59 | 最小取值，可以和Max 取值一样。默认222.66.65.59 |
    | DIP_Max        | 222.66.65.59 | 最大取值,默认222.66.65.59  |
    | DPORT_Min      | 6000 | 最小取值，可以和Max 取值一样。默认6000 |
    | DPORT_Max      | 6000 | 最大取值,默认6000 |
    | DSCPMarkValue  | 4 | DSCP值,默认4  |
    | M802_1_P_Value | 4 | 802.1p值,默认4 |
    | ClassQueue     | 1 | 有四个队列可选:1,2,3,4,缺省值:1 |
    
            
    
    注意:平台不做值的判断,统一由CPE决定值是否合法.
    第一条流基于DIP(目的IP)的规则,第二条流是基于DPORT(目的端口)的规则.
"""


# -----------------------------args--------------------------
# 工单 参数
WORKLIST_ARGS = {
"DIP_Min":("222.66.65.59", "1"),
"DIP_Max":("222.66.65.59", "2"),
"DPORT_Min":("6000", "3"),
"DPORT_Max":("6000", "4"),
"DSCPMarkValue":("4", "5"),
"M802_1_P_Value":("4", "6"),
"ClassQueue":("1", "7")
}

