# coding:utf-8


# -----------------------------doc--------------------------
# 工单 描述
WORKLIST_DOC = """
功能描述：生成一个基于DSCP的QoS保障测试工单

    参数：
    | Min            | 10 | 最小取值，可以和Max 取值一样。默认10 |
    | Max            | 10 | 最大取值,默认10  |
    | DSCPMarkValue  | 1 | DSCP值,默认1  |
    | M802_1_P_Value | 1 | 802.1p值,默认1 |
    | ClassQueue     | 1 | 有四个队列可选:1,2,3,4,缺省值:1 |
    
            
    
    注意:平台不做值的判断,统一由CPE决定值是否合法.
"""

# -----------------------------args--------------------------
# 工单 参数
WORKLIST_ARGS = {
    "Min": ("10", "1"),
    "Max": ("10", "2"),
    "DSCPMarkValue": ("1", "3"),
    "M802_1_P_Value": ("1", "4"),
    "ClassQueue": ("1", "5")
}
